// підключаємо бібліотеки
#include <stdio.h>
#include <windows.h>

int main() {
  SetConsoleCP(1251); // для кирилиці
  SetConsoleOutputCP(1251);
    int n = 0, count = 0; // створуєммо змінні
    printf("Введіть число n: ");
    scanf("%d", &n); // скануємо число
    while (n < 1 || n > 150) // перевірка на n менше 150 та більше 1
    {
        printf("Введіть число 1 < n < 150: "); // повідомлення користувачу за неправельний ввід
        scanf("%d", &n);   } // скануємо число
    for (int m = 1; m <= n; m++) { // умова циклу
        if (n % m == n / m) { // обчислення по формулі з теоретичних відомостей
            count++; // змінна в якій сумується результат
        }
    }
    printf("Кількість рівних дільників для числа %d: %d\n", n, count); // вивід результату
    system("pause"); // зупинка програми
    exit (3); // примусове зупинення виконання програми
}
